tap "homebrew/bundle"
tap "homebrew/services"

# Modern Unix
brew "bat"       # cat replacement
brew "fd"        # find replacement 
brew "httpie"    # curl replacement (for some usecases)
brew "lsd"       # ls replacement
brew "ripgrep"   # grep replacement
brew "zoxide"    # cd replacement

# Programming languages
brew "go"
brew "ipython"
brew "poetry"
brew "juliaup"

# Containers
brew "dive"
brew "podman-compose"

# Backup
brew "autorestic"    # Backup my files
brew "chezmoi"       # Dotfile management
brew "rbw"           # Required for storing secrets in chezmoi
brew "syncthing", restart_service: true # Sync files from my phone

# Misc
brew "yt-dlp"
brew "xdg-ninja", args: ["HEAD"]
brew "tlrc"
brew "numbat"
brew "aerc"
